Revit 2026 API

# ParameterTypeIdEnergyAnalysisShadeDepth Property

---

"Shade Depth"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId EnergyAnalysisShadeDepth { get; }
```
```vb
Public Shared ReadOnly Property EnergyAnalysisShadeDepth As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ EnergyAnalysisShadeDepth {
	ForgeTypeId^ get ();
}
```
```fsharp
static member EnergyAnalysisShadeDepth : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace